---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarShapeConstraint
source: html/19e05dfb-6373-bb62-51c5-994719808431.htm
---
# RebarShapeConstraint Methods

Return the Id of the parameter associated with this constraint.